Revit 2027 API
RebarSpliceUtils.GetSpliceChain Method
 Returns all the rebars that are part of a splice chain with the input rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetSpliceChain(
	Rebar rebar
)
Public Shared Function GetSpliceChain (
	rebar As Rebar
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetSpliceChain(
	Rebar^ rebar
)
static member GetSpliceChain :
        rebar : Rebar -> IList<ElementId>
Parameters
rebar Rebar
 The input rebar.
Return Value
IList<ElementId>
 Returns all the rebars that are part of a splice chain with the input rebar.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
The elements in the output list are in exactly in the same order as they are connected.
For Shape Driven Rebar, the first element in the array is the one whose Rebar Plane, Out of Plane Extent and Edge are not constrained to a rebar from the chain Second is constrained to first, third to second and so on.
For Free Form Rebar there are no RebarConstraints between sets. They are just listed in the order where the first is having lap with second, the second is having a lap with the third and so on.
The output list will also contain the input rebar id. If the rebar is not in a splice chain the returned list will contain just one element which is the id of the input rebar.
See Also
Reference
RebarSpliceUtils Class
Autodesk.Revit.DB.Structure Namespace